Changes in README - mermaid for architecture added few sections. added CI
